leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxXbar_regdef.h
/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER4_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS:29;                /**< \brief [30:2] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER4_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER4_DBMADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS:29;                /**< \brief [30:2] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER4_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER6_DBADD_Bits
{
    unsigned int reserved_0:28;             /**< \brief \internal Reserved */
    unsigned int ADDRESS:3;                 /**< \brief [30:28] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER6_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER6_DBMADD_Bits
{
    unsigned int reserved_0:28;             /**< \brief \internal Reserved */
    unsigned int ADDRESS:3;                 /**< \brief [30:28] Debug Address Boundary (rw) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER6_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITER7_DBADD_Bits
{
    unsigned int reserved_0:29;             /**< \brief \internal Reserved */
    unsigned int ADDRESS:1;                 /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER7_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITER7_DBMADD_Bits
{
    unsigned int reserved_0:29;             /**< \brief \internal Reserved */
    unsigned int ADDRESS:1;                 /**< \brief [29:29] Debug Address Boundary (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_ARBITER7_DBMADD_Bits;

/** \brief  Debug Address Register */
typedef struct _Ifx_XBAR_ARBITERD_DBADD_Bits
{
    unsigned int reserved_0:2;              /**< \brief \internal Reserved */
    unsigned int ADDRESS:30;                /**< \brief [31:2] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITERD_DBADD_Bits;

/** \brief  Debug Mask Address Register */
typedef struct _Ifx_XBAR_ARBITERD_DBMADD_Bits
{
    unsigned int ADDRESS:32;                /**< \brief [31:0] Debug Address Boundary (rw) */
} Ifx_XBAR_ARBITERD_DBMADD_Bits;

/** \brief  Debug Control Register */
typedef struct _Ifx_XBAR_DBCON_Bits
{
    unsigned int DBEN:1;                    /**< \brief [0:0] Status of OCDS Enable Signal (r) */
    unsigned int DBSAT:1;                   /**< \brief [1:1] Debug (OCDS) Trigger Status (rh) */
    unsigned int REARM:1;                   /**< \brief [2:2] Rearm Debug (OCDS) Trigger (w) */
    unsigned int SETDBEVT:1;                /**< \brief [3:3] Set Debug Event (w) */
    unsigned int reserved_4:12;             /**< \brief \internal Reserved */
    unsigned int RDEN:1;                    /**< \brief [16:16] Read Trigger Enable (rw) */
    unsigned int WREN:1;                    /**< \brief [17:17] Write Trigger Enable (rw) */
    unsigned int SVMEN:1;                   /**< \brief [18:18] SVM Trigger Enable (rw) */
    unsigned int ADDEN:1;                   /**< \brief [19:19] Address Trigger Enable (rw) */
    unsigned int ERREN:1;                   /**< \brief [20:20] Error Trigger Enable (rw) */
    unsigned int reserved_21:2;             /**< \brief \internal Reserved */
    unsigned int MASEN:1;                   /**< \brief [23:23] Master Trigger Enable (rw) */
    unsigned int MASTER:6;                  /**< \brief [29:24] Master TAG ID Trigger Selector (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_DBCON_Bits;

/** \brief  Debug Trigger Event Status Register */
typedef struct _Ifx_XBAR_DBSAT_Bits
{
    unsigned int SCI0:1;                    /**< \brief [0:0] SCI Debug Trigger Event Status (rwh) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int SCI4:1;                    /**< \brief [4:4] SCI Debug Trigger Event Status (rwh) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int SCI6:1;                    /**< \brief [6:6] SCI Debug Trigger Event Status (rwh) */
    unsigned int SCI7:1;                    /**< \brief [7:7] SCI Debug Trigger Event Status (rwh) */
    unsigned int reserved_8:7;              /**< \brief \internal Reserved */
    unsigned int SCID:1;                    /**< \brief [15:15] Default Slave Debug Trigger Event Status (rwh) */
    unsigned int reserved_16:16;            /**< \brief \internal Reserved */
} Ifx_XBAR_DBSAT_Bits;

/** \brief  Error/Debug Capture Register */
typedef struct _Ifx_XBAR_ERR_Bits
{
    unsigned int RD:1;                      /**< \brief [0:0] Read Indication Status (rh) */
    unsigned int WR:1;                      /**< \brief [1:1] Write Indication Status (rh) */
    unsigned int SVM:1;                     /**< \brief [2:2] Supervisor Mode Indication Status (rh) */
    unsigned int reserved_3:1;              /**< \brief \internal Reserved */
    unsigned int OPC:4;                     /**< \brief [7:4] Operation Code (rh) */
    unsigned int TR_ID:8;                   /**< \brief [15:8] Transaction ID (rh) */
    unsigned int ADDR_ECC:8;                /**< \brief [23:16] SRI Address Phase ECC (rh) */
    unsigned int MCI_SBS:8;                 /**< \brief [31:24] MCI Sideband Signals [7:0] (rh) */
} Ifx_XBAR_ERR_Bits;

/** \brief  Error/Debug Address Capture Register */
typedef struct _Ifx_XBAR_ERRADDR_Bits
{
    unsigned int ADDR:32;                   /**< \brief [31:0] Transaction Address (rh) */
} Ifx_XBAR_ERRADDR_Bits;

/** \brief  External Control Register D */
typedef struct _Ifx_XBAR_EXTCOND_Bits
{
    unsigned int reserved_0:3;              /**< \brief \internal Reserved */
    unsigned int WFWD:1;                    /**< \brief [3:3] Wait for FPI Write Data (rw) */
    unsigned int reserved_4:2;              /**< \brief \internal Reserved */
    unsigned int FREQDISF:1;                /**< \brief [6:6] Disable Fast Request Feature for FPI to SRI Transactions (rw) */
    unsigned int reserved_7:2;              /**< \brief \internal Reserved */
    unsigned int NODELTR:1;                 /**< \brief [9:9] Control Signal for deferred transactions (rw) */
    unsigned int NORMW:1;                   /**< \brief [10:10] Control Signal for deferred transactions (rw) */
    unsigned int reserved_11:2;             /**< \brief \internal Reserved */
    unsigned int MAX_WS:7;                  /**< \brief [19:13] FPI-Bus Wait State Retry Ratio (rw) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_XBAR_EXTCOND_Bits;

/** \brief  Module Identification Register */
typedef struct _Ifx_XBAR_ID_Bits
{
    unsigned int MODREV:8;                  /**< \brief [7:0] Module Revision Number (r) */
    unsigned int MODTYPE:8;                 /**< \brief [15:8] Module Type (r) */
    unsigned int MODNUMBER:16;              /**< \brief [31:16] Module Number Value (r) */
} Ifx_XBAR_ID_Bits;

/** \brief  Transaction ID Interrupt Enable Register */
typedef struct _Ifx_XBAR_IDINTEN_Bits
{
    unsigned int ENSCI0:1;                  /**< \brief [0:0] Enable ID Error from SCI0 (rw) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int ENSCI4:1;                  /**< \brief [4:4] Enable ID Error from SCI4 (rw) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int ENSCI6:1;                  /**< \brief [6:6] Enable ID Error from SCI6 (rw) */
    unsigned int ENSCI7:1;                  /**< \brief [7:7] Enable ID Error from SCI7 (rw) */
    unsigned int reserved_8:7;              /**< \brief \internal Reserved */
    unsigned int ENSCID:1;                  /**< \brief [15:15] Enable ID Error from Default Slave (rw) */
    unsigned int ENMCI0:1;                  /**< \brief [16:16] Enable ID Error from MCI0 (rw) */
    unsigned int reserved_17:4;             /**< \brief \internal Reserved */
    unsigned int ENMCI5:1;                  /**< \brief [21:21] Enable ID Error from MCI5 (rw) */
    unsigned int reserved_22:6;             /**< \brief \internal Reserved */
    unsigned int ENMCI12:1;                 /**< \brief [28:28] Enable ID Error from MCI12 (rw) */
    unsigned int ENMCI13:1;                 /**< \brief [29:29] Enable ID Error from MCI13 (rw) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_IDINTEN_Bits;

