leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxXbar_regdef.h
/** \brief  Transaction ID Interrupt Status Register */
typedef struct _Ifx_XBAR_IDINTSAT_Bits
{
    unsigned int IDSCI0:1;                  /**< \brief [0:0] Transaction ID Error from SCI0 Status (rwh) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int IDCSCI4:1;                 /**< \brief [4:4] Transaction ID Error from SCI4 Status (rwh) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int IDSCI6:1;                  /**< \brief [6:6] Transaction ID Error from SCI6 Status (rwh) */
    unsigned int IDSCI7:1;                  /**< \brief [7:7] Transaction ID Error from SCI7 Status (rwh) */
    unsigned int reserved_8:7;              /**< \brief \internal Reserved */
    unsigned int IDSCID:1;                  /**< \brief [15:15] Transaction ID Error from Default Slave Status (rwh) */
    unsigned int IDMCI0:1;                  /**< \brief [16:16] Transaction ID Error from MCI0 Status (rwh) */
    unsigned int reserved_17:4;             /**< \brief \internal Reserved */
    unsigned int IDMCI5:1;                  /**< \brief [21:21] Transaction ID Error from MCI5 Status (rwh) */
    unsigned int reserved_22:6;             /**< \brief \internal Reserved */
    unsigned int IDMCI12:1;                 /**< \brief [28:28] Transaction ID Error from MCI12 Status (rwh) */
    unsigned int IDMCI13:1;                 /**< \brief [29:29] Transaction ID Error from MCI13 Status (rwh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_XBAR_IDINTSAT_Bits;

/** \brief  Arbiter Interrupt Status Register */
typedef struct _Ifx_XBAR_INTSAT_Bits
{
    unsigned int SCSCI0:1;                  /**< \brief [0:0] Starvation Error from SCI0 Status (rwh) */
    unsigned int reserved_1:3;              /**< \brief \internal Reserved */
    unsigned int SCSCI4:1;                  /**< \brief [4:4] Starvation Error from SCI4 Status (rwh) */
    unsigned int reserved_5:1;              /**< \brief \internal Reserved */
    unsigned int SCSCI6:1;                  /**< \brief [6:6] Starvation Error from SCI6 Status (rwh) */
    unsigned int SCSCI7:1;                  /**< \brief [7:7] Starvation Error from SCI7 Status (rwh) */
    unsigned int reserved_8:7;              /**< \brief \internal Reserved */
    unsigned int SCSCID:1;                  /**< \brief [15:15] Starvation Error from Default Slave Status (rwh) */
    unsigned int PRSCI0:1;                  /**< \brief [16:16] Protocol Error from SCI0 Status (rwh) */
    unsigned int reserved_17:3;             /**< \brief \internal Reserved */
    unsigned int PRSCI4:1;                  /**< \brief [20:20] Protocol Error from SCI4 Status (rwh) */
    unsigned int reserved_21:1;             /**< \brief \internal Reserved */
    unsigned int PRSCI6:1;                  /**< \brief [22:22] Protocol Error from SCI6 Status (rwh) */
    unsigned int PRSCI7:1;                  /**< \brief [23:23] Protocol Error from SCI7 Status (rwh) */
    unsigned int reserved_24:7;             /**< \brief \internal Reserved */
    unsigned int PRSCID:1;                  /**< \brief [31:31] Protocol Error from Default Slave Status (rwh) */
} Ifx_XBAR_INTSAT_Bits;

/** \brief  Arbiter Priority Register */
typedef struct _Ifx_XBAR_PRIOH_Bits
{
    unsigned int reserved_0:32;             /**< \brief \internal Reserved */
} Ifx_XBAR_PRIOH_Bits;

/** \brief  Arbiter Priority Register */
typedef struct _Ifx_XBAR_PRIOL_Bits
{
    unsigned int MASTER0:4;                 /**< \brief [3:0] Master 0 Priority (rw) */
    unsigned int reserved_4:16;             /**< \brief \internal Reserved */
    unsigned int MASTER5:4;                 /**< \brief [23:20] Master 5 Priority (rw) */
    unsigned int MASTER6:4;                 /**< \brief [27:24] Master 6 Priority (rw) */
    unsigned int MASTER7:4;                 /**< \brief [31:28] Master 7 Priority (rw) */
} Ifx_XBAR_PRIOL_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Xbar_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ACCEN0_Bits B;                 /**< \brief Bitfield access */
} Ifx_XBAR_ACCEN0;

/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ACCEN1_Bits B;                 /**< \brief Bitfield access */
} Ifx_XBAR_ACCEN1;

/** \brief  Arbiter Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBCON_Bits B;                 /**< \brief Bitfield access */
} Ifx_XBAR_ARBCON;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER0_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER0_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER0_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER0_DBMADD;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER4_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER4_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER4_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER4_DBMADD;

