leonNg369/tc234_pxros_bsp_example/bsp/uc/uc_tc23/reg_tc23x_um_v1.1.R1/_Reg/IfxXbar_regdef.h
/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER6_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER6_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER6_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER6_DBMADD;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER7_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER7_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITER7_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITER7_DBMADD;

/** \brief  Debug Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITERD_DBADD_Bits B;         /**< \brief Bitfield access */
} Ifx_XBAR_ARBITERD_DBADD;

/** \brief  Debug Mask Address Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ARBITERD_DBMADD_Bits B;        /**< \brief Bitfield access */
} Ifx_XBAR_ARBITERD_DBMADD;

/** \brief  Debug Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_DBCON_Bits B;                  /**< \brief Bitfield access */
} Ifx_XBAR_DBCON;

/** \brief  Debug Trigger Event Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_DBSAT_Bits B;                  /**< \brief Bitfield access */
} Ifx_XBAR_DBSAT;

/** \brief  Error/Debug Capture Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ERR_Bits B;                    /**< \brief Bitfield access */
} Ifx_XBAR_ERR;

/** \brief  Error/Debug Address Capture Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ERRADDR_Bits B;                /**< \brief Bitfield access */
} Ifx_XBAR_ERRADDR;

/** \brief  External Control Register D */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_EXTCOND_Bits B;                /**< \brief Bitfield access */
} Ifx_XBAR_EXTCOND;

/** \brief  Module Identification Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_ID_Bits B;                     /**< \brief Bitfield access */
} Ifx_XBAR_ID;

/** \brief  Transaction ID Interrupt Enable Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_IDINTEN_Bits B;                /**< \brief Bitfield access */
} Ifx_XBAR_IDINTEN;

/** \brief  Transaction ID Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_IDINTSAT_Bits B;               /**< \brief Bitfield access */
} Ifx_XBAR_IDINTSAT;

/** \brief  Arbiter Interrupt Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_INTSAT_Bits B;                 /**< \brief Bitfield access */
} Ifx_XBAR_INTSAT;

/** \brief  Arbiter Priority Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_PRIOH_Bits B;                  /**< \brief Bitfield access */
} Ifx_XBAR_PRIOH;

/** \brief  Arbiter Priority Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_XBAR_PRIOL_Bits B;                  /**< \brief Bitfield access */
} Ifx_XBAR_PRIOL;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Xbar_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER0
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER0_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER0_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER0;

/** \brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER4
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER4_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER4_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER4;

/** \brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER6
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER6_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER6_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER6;

/** \brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITER7
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITER7_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITER7_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITER7;

/** \brief  Arbiter objects */
typedef volatile struct _Ifx_XBAR_ARBITERD
{
    Ifx_XBAR_ARBCON ARBCON;                 /**< \brief 0, Arbiter Control Register */
    Ifx_XBAR_PRIOH PRIOH;                   /**< \brief 4, Arbiter Priority Register */
    Ifx_XBAR_PRIOL PRIOL;                   /**< \brief 8, Arbiter Priority Register */
    Ifx_XBAR_ERRADDR ERRADDR;               /**< \brief C, Error/Debug Address Capture Register */
    Ifx_XBAR_ERR ERR;                       /**< \brief 10, Error/Debug Capture Register */
    Ifx_XBAR_DBCON DBCON;                   /**< \brief 14, Debug Control Register */
    Ifx_XBAR_ARBITERD_DBADD DBADD;          /**< \brief 18, Debug Address Register */
    Ifx_XBAR_ARBITERD_DBMADD DBMADD;        /**< \brief 1C, Debug Mask Address Register */
} Ifx_XBAR_ARBITERD;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Xbar_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \brief  XBAR object */
typedef volatile struct _Ifx_XBAR
{
    Ifx_XBAR_EXTCOND EXTCOND;               /**< \brief 0, External Control Register D */
    Ifx_XBAR_ARBITERD ARBITERD;             /**< \brief 4, Arbiter objects */
    unsigned char reserved_24[32];          /**< \brief 24, \internal Reserved */
    Ifx_XBAR_ARBITER0 ARBITER0;             /**< \brief 44, Arbiter objects */
    unsigned char reserved_64[224];         /**< \brief 64, \internal Reserved */
    Ifx_XBAR_ARBITER4 ARBITER4;             /**< \brief 144, Arbiter objects */
    unsigned char reserved_164[96];         /**< \brief 164, \internal Reserved */
    Ifx_XBAR_ARBITER6 ARBITER6;             /**< \brief 1C4, Arbiter objects */
    unsigned char reserved_1E4[32];         /**< \brief 1E4, \internal Reserved */
    Ifx_XBAR_ARBITER7 ARBITER7;             /**< \brief 204, Arbiter objects */
    unsigned char reserved_224[484];        /**< \brief 224, \internal Reserved */
    Ifx_XBAR_ID ID;                         /**< \brief 408, Module Identification Register */
    Ifx_XBAR_DBSAT DBSAT;                   /**< \brief 40C, Debug Trigger Event Status Register */
    Ifx_XBAR_INTSAT INTSAT;                 /**< \brief 410, Arbiter Interrupt Status Register */
    Ifx_XBAR_IDINTSAT IDINTSAT;             /**< \brief 414, Transaction ID Interrupt Status Register */
    Ifx_XBAR_IDINTEN IDINTEN;               /**< \brief 418, Transaction ID Interrupt Enable Register */
    unsigned char reserved_41C[220];        /**< \brief 41C, \internal Reserved */
    Ifx_XBAR_ACCEN1 ACCEN1;                 /**< \brief 4F8, Access Enable Register 1 */
    Ifx_XBAR_ACCEN0 ACCEN0;                 /**< \brief 4FC, Access Enable Register 0 */
} Ifx_XBAR;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXXBAR_REGDEF_H */
